---
type: ICodeCheckingParameterServer
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# ICodeCheckingParameterServer

`Autodesk.Revit.DB.Structure.ICodeCheckingParameterServer` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | PerformCodeChecking | 2014 | `bool PerformCodeChecking ( CodeCheckingParameterServiceData data )` |